* DONE finish DarkLordStoreActivity
CLOSED: [2021-10-20 Wed 21:55]
:LOGBOOK:
CLOCK: [2021-10-20 Wed 16:39]--[2021-10-22 Fri 14:13] => 45:34
:END:
[2021-10-20 Wed 16:39]
[[file:/mnt/d/x4-server-trunk/src/global/yyact/dark_lord_store.lua::DarkLordStoreActivity = class("res.config.DarkLordStoreActivity","ActivityBase")]]
* DONE ShenQiSecKillActivity
CLOSED: [2021-10-22 Fri 20:32]
:LOGBOOK:
CLOCK: [2021-10-21 Thu 11:53]--[2021-10-21 Thu 14:13] =>  2:20
CLOCK: [2021-10-20 Wed 21:55] finish 90% left proto to finish

:END:
[2021-10-20 Wed 21:55]
[[file:/mnt/d/x4-server-trunk/src/global/yyact/shenyu_seckill.lua::ShenYuSecKillActivity = class("res.config.ShenYuSecKillActivity","ActivityBase")]]
* DONE want protoss activity
CLOSED: [2021-10-30 Sat 09:41] SCHEDULED: <2021-10-25 Mon>
:LOGBOOK:
CLOCK: [2021-10-22 Fri 20:31]--[2021-10-22 Fri 20:31] =>  0:00 finish left gameLog
CLOCK: [2021-10-22 Fri 17:13]--[2021-10-22 Fri 17:46] =>  0:33 tournament finish : bug to fix?
CLOCK: [2021-10-22 Fri 17:04]--[2021-10-22 Fri 17:12] =>  0:08 finish fuben
CLOCK: [2021-10-22 Fri 14:13]--[2021-10-22 Fri 15:17] =>  1:04 
CLOCK: [2021-10-21 Thu 15:25]--[2021-10-21 Thu 15:46] =>  0:21 

:END:
[2021-10-21 Thu 15:25]
[[file:/mnt/d/x4-server-trunk/src/global/yyact/want_protoss.lua::WantProtossActivity = class("res.config.WantProtossActivity", "ActivityBase")]]

* DONE watch algorithm 1 hour
CLOSED: [2021-10-30 Sat 09:40] DEADLINE: <2021-10-23 Sat 18:30> SCHEDULED: <2021-10-23 Sat>
:LOGBOOK:
CLOCK: [2021-10-23 Sat 15:09]
:END:

* TODO leetcode                                                       :@company:
DEADLINE: <2021-10-30 Fri 23:00 +1d> SCHEDULED: <2021-10-30 Fri 21:00 +1d>

* TODO basic_algrothim                                                :@company:
DEADLINE: <2021-10-30 Fri 13:20 +1d> SCHEDULED: <2021-10-30 Fri 12:00 +1d>
